#include <stdio.h>
#include <locale.h>
int main()
{
	setlocale(LC_CTYPE, "RUS");
	printf("123\n"); // подзадание 1
	printf("1\n2\n3\n"); // подзадание 2
	printf("1\n\t2\n\t\t3\n"); // подзадание 3
	printf("%d\n%5d\n%10d\n%15d\n",1,2,3,4); // подзадание 4
	printf("%10.3f\n ", 12.234567); // подзадание 5
	printf("%10.5f\n ", 12.234567); // подзадание 6
	printf("Остаток от деления %d на %d равен %d\n", 5, 2, 5%2); // подзадание 7
	printf("Остаток от деления %d на %d равен %d\n", 7, 5, 7%5); // подзадание 8
	printf("Остаток от деления %d на %d равен %d\n", 2000, 4, 2000%4); // подзадание 9
	printf("%g разделить %e равно %f\n ", 5., 2000000., 5. / 2000000); // подзадание 10
	printf("%g разделить %e равно %d\n ", 5., 2000000., 5. / 2000000); // подзадание 10
	printf("%g разделить %e равно %e\n ", 5., 2000000., 5. / 2000000); // подзадание 10



}